
% %--------------------------------------------------------------------------
% clc;
% clear all;
% 
% A = xlsread('data.xlsx', 1);
% b = xlsread('data.xlsx', 2);
% x = zeros(length(b), 1);
% r = zeros(length(b), 1);
% z = zeros(length(b), 1);
% x(:, 1) = zeros(length(b), 1);
% r(:, 1) = b - A * x(:, 1);
% z(:, 1) = r(:, 1);
% alpha0 = (r(:, 1)' * r(:, 1)) / ((A * r(:, 1))' * r(:, 1));
% x(:, 2) = x(:, 1) + alpha0 * z(:, 1);
% for k = 2 : 5
%      r(:, k) = b - A * x(:, k);
%      betak = -(r(:, k)' * A * z(:, k - 1)) / (z(:, k - 1)' * A * z(:, k - 1));
%      z(:, k) = r(:, k) + betak * z(:, k - 1);
%      alphak = (r(:, k)' * z(:, k)) / ((A * z(:, k))' * z(:, k));
%      x(:, k + 1) = x(:, k) + alphak * z(:, k);
% end
% 
% ans = A \ b
% [D X] = eig(A)
% % 不收敛 
% % 原因是 A非实对称正定矩阵
% % 该A有复特征值
% %--------------------------------------------------------------------------

% %--------------------------------------------------------------------------
% clc;
% clear all;
% 
% A = xlsread('data.xlsx', 3);
% b = xlsread('data.xlsx', 4);
% x = zeros(length(b), 1);
% r = zeros(length(b), 1);
% z = zeros(length(b), 1);
% x(:, 1) = zeros(length(b), 1);
% r(:, 1) = b - A * x(:, 1);
% z(:, 1) = r(:, 1);
% alpha0 = (r(:, 1)' * r(:, 1)) / ((A * r(:, 1))' * r(:, 1));
% x(:, 2) = x(:, 1) + alpha0 * z(:, 1);
% for k = 2 : 10
%      r(:, k) = b - A * x(:, k);
%      betak = -(r(:, k)' * A * z(:, k - 1)) / (z(:, k - 1)' * A * z(:, k - 1));
%      z(:, k) = r(:, k) + betak * z(:, k - 1);
%      alphak = (r(:, k)' * z(:, k)) / ((A * z(:, k))' * z(:, k));
%      x(:, k + 1) = x(:, k) + alphak * z(:, k);
% end
% 
% ans = A \ b
% [D X] = eig(A)
% % 收敛 
% % A是实对称矩阵
% % 但A不是正定矩阵
% % 说明共轭梯度法收敛定理中对称正定为充分条件，非必要条件
% % 但有一点问题，即如果用解向量作为初始向量，迭代序列会出现NaN
% %--------------------------------------------------------------------------

%--------------------------------------------------------------------------
clc;
clear all;

A = xlsread('data.xlsx', 5);
b = xlsread('data.xlsx', 6);
x = zeros(length(b), 1);
r = zeros(length(b), 1);
z = zeros(length(b), 1);
% x(:, 1) = zeros(length(b), 1);
x(:, 1) = [3.002 1.998 4.003];
r(:, 1) = b - A * x(:, 1);
z(:, 1) = r(:, 1);
alpha0 = (r(:, 1)' * r(:, 1)) / ((A * r(:, 1))' * r(:, 1));
x(:, 2) = x(:, 1) + alpha0 * z(:, 1);
for k = 2 : 10
     r(:, k) = b - A * x(:, k);
     betak = -(r(:, k)' * A * z(:, k - 1)) / (z(:, k - 1)' * A * z(:, k - 1));
     z(:, k) = r(:, k) + betak * z(:, k - 1);
     alphak = (r(:, k)' * z(:, k)) / ((A * z(:, k))' * z(:, k));
     x(:, k + 1) = x(:, k) + alphak * z(:, k);
end

ans = A \ b;
[D X] = eig(A);
% 收敛 
% A是实对称正定矩阵
% 满足共轭梯度法收敛条件
% 但有一点问题，即如果已经在某一步产生解向量，迭代序列会出现NaN
% 原因为r和z会变为0向量，产生除0操作，迭代步骤终止
%--------------------------------------------------------------------------

